--[[****************************************************************************
  * _NPCScan.Overlay by Saiket                                                 *
  * Locales/Locale-ruRU.lua - Localized string constants (ru-RU).              *
  ****************************************************************************]]


if ( GetLocale() ~= "ruRU" ) then
	return;
end


-- See http://wow.curseforge.com/addons/npcscan-overlay/localization/ruRU/
local Overlay = select( 2, ... );
Overlay.L.NPCs = setmetatable( {
	[ 18684 ] = "Бро'Газ Без Клана",
	[ 32491 ] = "Затерянный во времени протодракон",
	[ 33776 ] = "Гондрия",
	[ 35189 ] = "Сколл",
	[ 38453 ] = "Арктур",
	[ 49822 ] = "Яшмовый Клык",
	[ 49913 ] = "Леди Лала",
	[ 50005 ] = "Посейдус",
	[ 50009 ] = "Мобус",
	[ 50050 ] = "Шок'шарак",
	[ 50051 ] = "Призрачный краб",
	[ 50052 ] = "Углик Черносерд",
	[ 50053 ] = "Тартук Изгой",
	[ 50056 ] = "Гарр",
	[ 50057 ] = "Жарокрыл",
	[ 50058 ] = "Калентий",
	[ 50059 ] = "Голгарок",
	[ 50060 ] = "Тербурий",
	[ 50061 ] = "Зариона",
	[ 50062 ] = "Эонакс",
	[ 50063 ] = "Акма'хат",
	[ 50064 ] = "Сирус Блек",
	[ 50065 ] = "Армагедилло",
	[ 50085 ] = "Властитель Губительная Ярость",
	[ 50086 ] = "Тарвий Злобный",
	[ 50089 ] = "Джулак-Рок",
	[ 50138 ] = "Карома",
	[ 50154 ] = "Мадекс",
	[ 50159 ] = "Самбас",
	[ 51071 ] = "Капитан Флоренс",
	[ 51079 ] = "Капитан Злозюйд",
}, { __index = Overlay.L.NPCs; } );